[
  { "tableItem": "<b>Arguments:</b>", "description": "" },

  {
    "tableItem": "nobarf",
    "description": "garbo will do beginning of the day setup, embezzlers, and various daily flags, but will terminate before normal Barf Mountain turns."
  },
  {
    "tableItem": "ascend",
    "description": "garbo will operate under the assumption that you're ascending after running it, rather than experiencing rollover. It will use borrowed time, it won't charge stinky cheese items, etc."
  },
  {
    "tableItem": "[some_number]",
    "description": "garbo will terminate after the specified number of turns, e.g. \"garbo 200\" will terminate after 200 turns are spent. Negative inputs will cause garbo to terminate when the specified number of turns remain."
  },
  {
    "tableItem": "simdiet",
    "description": "garbo will print out what it computes as an optimal diet and then exit."
  },
  {
    "tableItem": "nodiet",
    "description": "*EXPERIMENTAL* garbo will not eat or drink anything as a part of its run (including pantsgiving)."
  },
  {
    "tableItem": "yachtzeechain",
    "description": "*EXPERIMENTAL* garbo only diets after free fights, and attempts to estimate if Yachtzee! chaining is profitable for you - if so, it consumes a specific diet which uses ~30-41 spleen; if not it automatically continues with the regular diet. Requires Spring Break Beach access (it will not grab a one-day pass for you, but will make an attempt if one is used). Sweet Synthesis is strongly recommended, as with access to other meat% buffs from Source Terminal, Fortune Teller, KGB and the summoning chamber. Having access to a PYEC (on hand or in the clan stash) is a plus."
  },
  {
    "tableItem": "Note on Arguments:",
    "description": "You can use multiple arguments in conjunction, e.g. \"garbo nobarf ascend\"."
  },

  { "tableItem": "<b>Properties:</b>", "description": "" },

  {
    "tableItem": "valueOfAdventure",
    "description": "This is a native mafia property, garbo will make purchasing decisions based on this value. Recommended to be at least 3501."
  },
  {
    "tableItem": "garbo_stashClan",
    "description": "If set, garbo will attempt to switch to this clan to take and return useful clan stash item, i.e. a Haiku Katana or Repaid Diaper."
  },
  {
    "tableItem": "garbo_vipClan",
    "description": "If set, garbo will attempt to switch to this clan to utilize VIP furniture if you have a key."
  },
  {
    "tableItem": "garbo_skipAscensionCheck",
    "description": "Set to true to skip verifying that your account has broken the prism, otherwise you will be warned upon starting the script."
  },
  {
    "tableItem": "garbo_valueOfFreeFight",
    "description": "Set to whatever you estimate the value of a free fight/run to be for you. (Default 2000)"
  },
  {
    "tableItem": "garbo_fightGlitch",
    "description": "Set to true to fight the glitch season reward. You need certain skills, see relay for info."
  },
  {
    "tableItem": "garbo_buyPass",
    "description": "Set to true to buy a Dinsey day pass with FunFunds at the end of the day, if possible."
  },
  {
    "tableItem": "garbo_autoUserConfirm",
    "description": "**WARNING: Experimental** Don't show user confirm dialogs, instead automatically select yes/no in a way that will allow garbo to continue executing. Useful for scripting/headless. Risky and potentially destructive."
  },
  {
    "tableItem": "Note on Properties:",
    "description": "You can manually set these properties, but it's recommended that you use the relay interface."
  }
]
